tap "homebrew/services"
tap "rest-sh/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Double-entry accounting tool that works on plain text files
brew "beancount"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Portable devkit for CI/CD pipelines
brew "dagger"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Small git utilities
brew "git-extras"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Fast linters runner for Go
brew "golangci-lint"
# Go manage your Ollama models
brew "gollama"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Library to render SVG files using Cairo
brew "librsvg"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Make/rake-like build tool using Go
brew "mage"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# CLI tool for interacting with REST-ish HTTP APIs
brew "restish"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# User-friendly GUI app for Homebrew
cask "applite"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Monitors common persistence locations
cask "blockblock"
# Web browser focusing on privacy
cask "brave-browser"
# Scans for dylib hijacking
cask "dhs"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Game of dungeon exploration, combat and magic
cask "dungeon-crawl-stone-soup-tiles"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-adwaita-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Password manager app
cask "keepassxc"
# Discover, download, and run local LLMs
cask "lm-studio"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Kubernetes and container management on the desktop
cask "rancher"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "pomdtr.excalidraw-editor"
vscode "stateful.runme"
vscode "vscodevim.vim"
