brew "automake"
brew "bzr"
brew "colormake"
brew "fontconfig"
brew "fzf"
brew "git"
brew "iftop"
brew "ipcalc"
brew "jq"
brew "libtool"
brew "macvim"
brew "md5sha1sum"
brew "mercurial"
brew "mongo"
brew "nvm"
brew "plenv"
brew "pyenv"
brew "qemu"
brew "rbenv"
brew "ruby-build"
brew "shellcheck"
brew "tccutil"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "trash"
brew "vim"
brew "zsh"

tap "beeftornado/rmtree"
brew "brew-rmtree"

cask_args appdir: "/Applications"
tap "caskroom/cask"
cask "aerial"
cask "appcode"
cask "atext"
cask "balsamiq-mockups"
cask "bartender"
cask "camtasia"
cask "clion"
cask "datagrip"
cask "diffmerge"
cask "dockertoolbox"
cask "dropbox"
cask "firefox"
cask "flash"
cask "flux"
cask "hipchat"
cask "imageoptim"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "karabiner"
cask "gas-mask"
cask "google-chrome"
cask "keepassx"
cask "macpar-deluxe"
cask "paparazzi"
cask "phpstorm"
cask "postgres"
cask "pycharm"
cask "rubymine"
cask "seil"
cask "sdformatter"
cask "sketch"
cask "sketch-toolbox"
cask "sonos"
cask "spotify"
cask "spotify-notifications"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "webstorm"
cask "witch"
cask "xscope"
cask "xquartz"
