brew "automake"
brew "bzr"
brew "fontconfig"
brew "git"
brew "ipcalc"
brew "libtool"
brew "macvim"
brew "mercurial"
brew "nvm"
brew "plenv"
brew "pyenv"
brew "rbenv"
brew "shellcheck"
brew "tccutil"
brew "the_silver_searcher"
brew "trash"
brew "vim"
brew "zsh"

cask_args appdir: "/Applications"
tap "caskroom/cask"
cask "appcode"
cask "camtasia"
cask "clion"
cask "datagrip"
cask "firefox"
cask "flash"
cask "flux"
cask "intellij-idea"
cask "google-chrome"
cask "keepassx"
cask "phpstorm"
cask "pycharm"
cask "rubymine"
cask "sonos"
cask "vlc"
cask "webstorm"
cask "xquartz"

tap "caskroom/versions"
cask "iterm2-beta"